
/*
 2.1 Для однієї з таблиць створити команду отримання символьних значень колонки з
переведенням першого символу у верхній регістр, інших у нижній. При виведенні на екран визначити
для вказаної колонки нову назву псевдоніму.
*/
select INITCAP(username) from usr;
/*Alban
George
Misha
Ivan
Anton
Anatolii
Ruslan
*/

/*
2.2. Модифікувати рішення попереднього завдання, створивши команду оновлення значення
вказаної колонки у таблиці.
*/
insert into usr VALUES(test_seq.currval,'Alban');
/*
2.3 Для однієї з символьних колонок однієї з таблиць створити команду отримання
мінімальної, середньої та максимальної довжин рядків.
*/
SELECT avg(LENGTH(username)) as awg,max(LENGTH(username)) as max,min(LENGTH(username)) as min FROM usr;
/*
/*5.57142857142857142857142857142857142857	8	4*/
2.4 Для колонки типу date однієї з таблиць отримати кількість днів, тижнів та місяців, що
пройшли до сьогодні.
*/
select trunc(to_date('10/24/2022','mm/dd/yyyy')-ord_date) from ord;
/*
9
9
*/
