/*
1. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає усереднені значення другої колонки кожного рядка в кожній підгрупі.
Використати аналітичну функцію на основі AVG, PARTITION BY.
*/
SELECT 
    make, 
	mode_car, 
    user_id,
	AVG(user_id) OVER (PARTITION BY make) avg_user_id 
FROM car;
/*
Kia	Sportage	1	13.5
Kia	Optima	26	13.5
Lamborgini	Urus	25	25
Lamborgini	Aventador	25	25
Nissan	Juke	2	2
Porsh	Carerra	25	25
Skoda	Octavia		
		2	2
*/

/*

2. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
отримає накопичувальні підсумки другої колонки.
Використати аналітичну функцію на основі AVG, ORDER BY.
*/

SELECT 
    make, 
	mode_car, 
	user_id, 
	AVG(user_id) OVER (
		         ORDER BY user_id
			 ) sum_user_id
FROM car; 
/*
Kia	Sportage	1	1
		2	1.66666666666666666666666666666666666667
Nissan	Juke	2	1.66666666666666666666666666666666666667
Porsh	Carerra	25	13.33333333333333333333333333333333333333
Lamborgini	Urus	25	13.33333333333333333333333333333333333333
Lamborgini	Aventador	25	13.33333333333333333333333333333333333333
Kia	Optima	26	15.14285714285714285714285714285714285714
Skoda	Octavia		15.14285714285714285714285714285714285714
*/


/*
3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
підгрупі окремо.
Використати аналітичну функцію на основі AVG, PARTITION BY, ORDER BY.
*/
SELECT 
    make, 
	mode_car, 
	user_id, 
	AVG(user_id) OVER (
	             PARTITION BY user_id
			 ) patrition_by,
    AVG(user_id) OVER (
	             ORDER BY user_id
			 ) order_by
             
FROM car; 

/*
Kia	Sportage	1	1	1
		2	2	1.66666666666666666666666666666666666667
Nissan	Juke	2	2	1.66666666666666666666666666666666666667
Porsh	Carerra	25	25	13.33333333333333333333333333333333333333
Lamborgini	Urus	25	25	13.33333333333333333333333333333333333333
Lamborgini	Aventador	25	25	13.33333333333333333333333333333333333333
Kia	Optima	26	26	15.14285714285714285714285714285714285714
Skoda	Octavia			15.14285714285714285714285714285714285714
*/
