/*
Одна з колонок таблиць повинна містити строкове значення з трьома різними буквами у
першій позиції. Створіть запит, який отримає три рядки таблиці з урахуванням трьох букв,
використовуючи оператор LIKE.
*/
SELECT * FROM dual 
WHERE 
    'abc11' LIKE '%a%' 
    OR 'abc11' LIKE '%b%' 
	OR 'abc11' LIKE '%c%';

/*
Повторіть завдання 1, використовуючи регулярні вирази з альтернативними варіантами.
*/

    
    SELECT * FROM dual 
WHERE 
    regexp_like('aaa11b', 'a|b|c');

    
select * from usr;
/*3. Одна з колонок таблиць повинна містити строкове значення з цифрами від 3 до 8 у
будь-якій позиції. Створіть запит, який отримає рядки таблиці з урахуванням присутності у
вказаній колонці будь-якої цифри від 3 до 8.*/
select * from usr where regexp_like(user_id, '[3-8]');
SELECT * from usr
/*4. Створіть запит, який отримає рядки таблиці з урахуванням відсутності в зазначеній
колонці будь-якої цифри від 3 до 8. fix*/
select * from usr where regexp_like(user_id, '[^3-8]');

/*
Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше вказаній
колонці поєднання будь-яких трьох цифр розміщених підряд від 3 до 8.
*/
select * from usr where regexp_like(user_id, '[3-8]{2}');


     
 