/*1. Створіть запит, який отримає рядки таблиці з урахуванням присутності в раніше
вказаній колонці поєднання будь-яких двох підряд розташованих цифр, або трьох підряд
розташованих букв.*/
select * from usr where regexp_like(user_id, '([a-z]{2}|[0-9]{2})');

/*
2. Одна з колонок таблиць повинна містити строкове значення з двома однаковими
буквами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
колонки.
*/
select * from usr where regexp_like(username, '([[:alpha:]])\1');

/*
3. Одна з колонок таблиць повинна містити строкове значення з двома однаковими
словами, що повторюються підряд. Створіть запит, який отримає рядки таблиці з таким значенням
колонки.
*/
SELECT * from usr 
WHERE 
     regexp_like(
	     username,
         '([[:alpha:]]+)([[:space:]]+)\1');
/*
4. Одна з колонок таблиць повинна містити строкове значення з номером мобільного
телефону у форматі +XX(XXX)XXX-XX-XX, де X – цифра. Створіть запит, який отримає рядки
таблиці з таким значенням колонки./fix
*/
SELECT * FROM dual 
WHERE 
    regexp_like(
	    '@77(777)777-77-77',
		'^@\d{2}\(\d{3}\)\d{3}\-\d{2}\-\d{2}');
/*
5. Одна з колонок таблиць має містити строкове значення з електронною поштовою
адресою у форматі EEE@EEE.EEE.UA, де E – будь-яка латинська буква. Створіть запит, який
отримає рядки таблиці з таким значенням колонки.
*/
SELECT * FROM dual 
WHERE 
    regexp_like(
	    'pas@meg.com.UA',
		'[A-Z a-z]{3}\@[A-Z a-z]{3}.[A-Z a-z]{3}.UA')
